{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 112, 112], "dtype": "float32", "sparse": false, "ragged": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "163_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "163_pad", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "163", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "163", "inbound_nodes": [[["163_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "165", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "165", "inbound_nodes": [[["163", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "166_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "166_pad", "inbound_nodes": [[["165", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "166", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "166", "inbound_nodes": [[["166_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "168", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "168", "inbound_nodes": [[["166", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "169", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "169", "inbound_nodes": [[["168", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "171", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "171", "inbound_nodes": [[["169", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "172_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "172_pad", "inbound_nodes": [[["171", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "172", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "172", "inbound_nodes": [[["172_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "174", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "174", "inbound_nodes": [[["172", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "175", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "175", "inbound_nodes": [[["174", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "177", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "177", "inbound_nodes": [[["175", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "178_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "178_pad", "inbound_nodes": [[["177", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "178", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "178", "inbound_nodes": [[["178_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "180", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "180", "inbound_nodes": [[["178", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "181", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "181", "inbound_nodes": [[["180", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "183", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "183", "inbound_nodes": [[["181", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "184_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "184_pad", "inbound_nodes": [[["183", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "184", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "184", "inbound_nodes": [[["184_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "186", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "186", "inbound_nodes": [[["184", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "187", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "187", "inbound_nodes": [[["186", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "189", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "189", "inbound_nodes": [[["187", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "190_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "190_pad", "inbound_nodes": [[["189", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "190", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "190", "inbound_nodes": [[["190_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "192", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "192", "inbound_nodes": [[["190", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "193", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "193", "inbound_nodes": [[["192", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "195", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "195", "inbound_nodes": [[["193", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "196_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "196_pad", "inbound_nodes": [[["195", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "196", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "196", "inbound_nodes": [[["196_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "198", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "198", "inbound_nodes": [[["196", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "199", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "199", "inbound_nodes": [[["198", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "201", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "201", "inbound_nodes": [[["199", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "202_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "202_pad", "inbound_nodes": [[["201", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "202", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "202", "inbound_nodes": [[["202_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "204", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "204", "inbound_nodes": [[["202", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "205", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "205", "inbound_nodes": [[["204", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "output1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "output1", "inbound_nodes": [[["205", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "218_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "218_pad", "inbound_nodes": [[["output1", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "218", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "218", "inbound_nodes": [[["218_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "220", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "220", "inbound_nodes": [[["218", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "221", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "221", "inbound_nodes": [[["220", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "223", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "223", "inbound_nodes": [[["221", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "224_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "224_pad", "inbound_nodes": [[["223", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "224", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "224", "inbound_nodes": [[["224_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "226", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "226", "inbound_nodes": [[["224", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "227", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "227", "inbound_nodes": [[["226", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "229", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "229", "inbound_nodes": [[["227", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "230_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "230_pad", "inbound_nodes": [[["229", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "230", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "230", "inbound_nodes": [[["230_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "232", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "232", "inbound_nodes": [[["230", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "233", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "233", "inbound_nodes": [[["232", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "235", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "235", "inbound_nodes": [[["233", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "236_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "236_pad", "inbound_nodes": [[["235", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "236", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "236", "inbound_nodes": [[["236_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "238", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "238", "inbound_nodes": [[["236", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "239", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "239", "inbound_nodes": [[["238", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "241", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "241", "inbound_nodes": [[["239", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "242_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "242_pad", "inbound_nodes": [[["241", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "242", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "242", "inbound_nodes": [[["242_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "244", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "244", "inbound_nodes": [[["242", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "245", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "245", "inbound_nodes": [[["244", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "247", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "247", "inbound_nodes": [[["245", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "258", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "258", "inbound_nodes": [[["247", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "259", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "259", "inbound_nodes": [[["258", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "260_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "260_pad", "inbound_nodes": [[["259", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "260", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "260", "inbound_nodes": [[["260_pad", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "208_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "208_pad", "inbound_nodes": [[["output1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "261", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "261", "inbound_nodes": [[["260", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "208", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "208", "inbound_nodes": [[["208_pad", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "248", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "248", "inbound_nodes": [[["247", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "262", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "262", "inbound_nodes": [[["261", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "209", "trainable": true, "dtype": "float32", "data_format": "channels_first"}, "name": "209", "inbound_nodes": [[["208", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "249", "trainable": true, "dtype": "float32", "data_format": "channels_first"}, "name": "249", "inbound_nodes": [[["248", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "263", "trainable": true, "dtype": "float32", "data_format": "channels_first"}, "name": "263", "inbound_nodes": [[["262", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "209_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+llEOi9Qcm9ncmFtIEZpbGVzL2FuYWNvbmRhMy9lbnZzL3BhZGRsZV9l\nbnYvbGliL3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFyZ2V0\nX2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "209_EXPAND1", "inbound_nodes": [[["209", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "249_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+llEOi9Qcm9ncmFtIEZpbGVzL2FuYWNvbmRhMy9lbnZzL3BhZGRsZV9l\nbnYvbGliL3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFyZ2V0\nX2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "249_EXPAND1", "inbound_nodes": [[["249", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "263_EXPAND1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+llEOi9Qcm9ncmFtIEZpbGVzL2FuYWNvbmRhMy9lbnZzL3BhZGRsZV9l\nbnYvbGliL3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFyZ2V0\nX2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "263_EXPAND1", "inbound_nodes": [[["263", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "209_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+llEOi9Qcm9ncmFtIEZpbGVzL2FuYWNvbmRhMy9lbnZzL3BhZGRsZV9l\nbnYvbGliL3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFyZ2V0\nX2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "209_EXPAND2", "inbound_nodes": [[["209_EXPAND1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "249_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+llEOi9Qcm9ncmFtIEZpbGVzL2FuYWNvbmRhMy9lbnZzL3BhZGRsZV9l\nbnYvbGliL3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFyZ2V0\nX2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "249_EXPAND2", "inbound_nodes": [[["249_EXPAND1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "263_EXPAND2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAIAAAADAAAAUwAAAHMYAAAAZAFkAmwAbQF9AQEAfAFqAqADfAChAVMAKQNO\n6QAAAAApAdoFa2VyYXMpBNoKdGVuc29yZmxvd3ICAAAA2gdiYWNrZW5k2gtleHBhbmRfZGltcykC\n2gF4cgIAAACpAHIHAAAA+llEOi9Qcm9ncmFtIEZpbGVzL2FuYWNvbmRhMy9lbnZzL3BhZGRsZV9l\nbnYvbGliL3NpdGUtcGFja2FnZXMvb25ueDJrZXJhcy9wb29saW5nX2xheWVycy5wedoMdGFyZ2V0\nX2xheWVymAAAAHMEAAAAAAEMAQ==\n", null, null], "function_type": "lambda", "module": "onnx2keras.pooling_layers", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "263_EXPAND2", "inbound_nodes": [[["263_EXPAND1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "217", "trainable": true, "dtype": "float32", "data_format": "channels_first"}, "name": "217", "inbound_nodes": [[["209_EXPAND2", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "257", "trainable": true, "dtype": "float32", "data_format": "channels_first"}, "name": "257", "inbound_nodes": [[["249_EXPAND2", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "271", "trainable": true, "dtype": "float32", "data_format": "channels_first"}, "name": "271", "inbound_nodes": [[["263_EXPAND2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "272", "trainable": true, "dtype": "float32", "axis": 1}, "name": "272", "inbound_nodes": [[["217", 0, 0, {}], ["257", 0, 0, {}], ["271", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 212, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output", "inbound_nodes": [[["272", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["output1", 0, 0], ["output", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "163/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "163/bias", "shape": [16], "dtype": "float32"}, {"name": "166/depthwise_kernel", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "166/bias", "shape": [16], "dtype": "float32"}, {"name": "169/kernel", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "169/bias", "shape": [32], "dtype": "float32"}, {"name": "172/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "172/bias", "shape": [32], "dtype": "float32"}, {"name": "175/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "175/bias", "shape": [32], "dtype": "float32"}, {"name": "178/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "178/bias", "shape": [32], "dtype": "float32"}, {"name": "181/kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "181/bias", "shape": [32], "dtype": "float32"}, {"name": "184/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "184/bias", "shape": [32], "dtype": "float32"}, {"name": "187/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "187/bias", "shape": [64], "dtype": "float32"}, {"name": "190/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "190/bias", "shape": [64], "dtype": "float32"}, {"name": "193/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "193/bias", "shape": [64], "dtype": "float32"}, {"name": "196/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "196/bias", "shape": [64], "dtype": "float32"}, {"name": "199/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "199/bias", "shape": [64], "dtype": "float32"}, {"name": "202/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "202/bias", "shape": [64], "dtype": "float32"}, {"name": "205/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "205/bias", "shape": [64], "dtype": "float32"}, {"name": "208/kernel", "shape": [3, 3, 64, 16], "dtype": "float32"}, {"name": "208/bias", "shape": [16], "dtype": "float32"}, {"name": "218/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "218/bias", "shape": [64], "dtype": "float32"}, {"name": "221/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "221/bias", "shape": [128], "dtype": "float32"}, {"name": "224/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "224/bias", "shape": [128], "dtype": "float32"}, {"name": "227/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "227/bias", "shape": [128], "dtype": "float32"}, {"name": "230/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "230/bias", "shape": [128], "dtype": "float32"}, {"name": "233/kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}, {"name": "233/bias", "shape": [128], "dtype": "float32"}, {"name": "236/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "236/bias", "shape": [128], "dtype": "float32"}, {"name": "239/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "239/bias", "shape": [256], "dtype": "float32"}, {"name": "242/depthwise_kernel", "shape": [3, 3, 256, 1], "dtype": "float32"}, {"name": "242/bias", "shape": [256], "dtype": "float32"}, {"name": "245/kernel", "shape": [1, 1, 256, 256], "dtype": "float32"}, {"name": "245/bias", "shape": [256], "dtype": "float32"}, {"name": "248/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "248/bias", "shape": [64], "dtype": "float32"}, {"name": "258/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "258/bias", "shape": [64], "dtype": "float32"}, {"name": "260/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "260/bias", "shape": [64], "dtype": "float32"}, {"name": "262/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "262/bias", "shape": [128], "dtype": "float32"}, {"name": "output/kernel", "shape": [208, 212], "dtype": "float32"}, {"name": "output/bias", "shape": [212], "dtype": "float32"}]}]}